Third_Party_Modules/OpenFoamFSI/trunk/testing/share/Testing/test_data/HronTurekFsiPar/fluid/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch plate;
solidZone plateZone;

fluidPatch plate;
fluidZone plateZone;

//movingRegion region0;

fsiRelaxationFactor 0.01;

interfaceDeformationLimit 0.01;

outerCorrTolerance 1e-4;

couplingScheme Aitken;

fsi yes;

// ************************************************************************* //
